/**
 ******************************************************************************
 ** ファイル名 : Driver.h
 ** クラス名   : Driver
 **
 ** 概要 : 走行体に指示するクラス
 ******************************************************************************
 **/
#ifndef RUNNER_DRIVER_H
#define RUNNER_DRIVER_H

#include "Runner.h"
#include "../scenario/Course.h"
#include "Clock.h"

class Driver
{
private:
    Runner* runner;
    Course* mCourse;
    Course dCourse[4]{
   /* テスト用　ライントレースし続けるだけ　*/
   /*  {  距離,時間,衝撃,障害,  前進,旋回,尻尾,Gyro  P   ,    I   ,    D  ,目標RGB,走行法} */
       {     1,    0,  0,  0,      60,  0, 95,   0, 0.0300F, 0.0000F, 1.0000F, 1.00F, 1 },  //  初期化配列
       {     0,    8,  0,  0,      60,  0, 96,   0, 0.0300F, 0.0000F, 1.0000F, 1.00F, 1 },  //  Start時
       { 20000,    0,  0,  0,      40,  0,  0,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F, 1 },  //  ライントレース
       {     0,    0,  0,  0,       0,  0, 81,   0, 0.0000F, 0.0000F, 0.0000F, 1.00F, 0 }   //  完全停止用終端配列
    };
    Course lCourse[17]{
   /* テスト用　ライントレースし続けるだけ　*/
   /*  {  距離,時間,衝撃,障害,  前進,旋回,尻尾,Gyro  P   ,    I   ,    D  ,目標RGB,走行法} */
 /*  {  距離,  時間,衝撃,障害,  前進,旋回,尻尾,Gyro,    P   ,    I   ,    D  ,目標RGB,走行法} */
        {     1,    0,   0,  0,    80,  0,  91,   0, 0.0300F, 0.0000F, 0.9000F, 1.00F,   1 },  //   初期化配列
        {     0,    8,   0,  0,    80,  0,  97,   0, 0.0300F, 0.0000F, 0.9000F, 1.00F,   1 },  //   Start時
        {   620,    0,   0,  0,    80,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //   1 直進
        {  1200,    0,   0,  0,    60,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,  1 },  //   2 左カーブ
        {   660,    0,   0,  0,    80,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //   3 直進
        {   360,    0,   0,  0,    60,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //   4 左カーブ
        {   360,    0,   0,  0,    80,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //   5 直線
        {   190,    0,   0,  0,    60,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,  1 },  //   6 左カーブ
        {   720,    0,   0,  0,    60,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //   7 右カーブ
        {   320,    0,   0,  0,    80,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //   8 直進
        {   660,    0,   0,  0,    60,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //   9 右カーブ
        {  1030,    0,   0,  0,    80,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,  1 },  //  10 直進
        {   800,    0,   0,  0,    60,  0,  5,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //  11 右カーブ
        {   360,    0,   0,  0,    80,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //  12 直線
        {  1470,    0,   0,  0,    60,  0,  5,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //  13 右カーブ
        {   400,    0,   0,  0,    60,  0,  45,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F,   1 },  //  14 左カーブ
        {   370,    0,   0,  0,    80,  0,   5,   0, 0.0900F, 0.0000F, 0.8000F, 1.00F,   1 },  //  15 直線
    };
    Course rCourse[4]{
   /* テスト用　ライントレースし続けるだけ　*/
   /*  {  距離,時間,衝撃,障害,  前進,旋回,尻尾,Gyro  P   ,    I   ,    D  ,目標RGB,走行法} */
       {     1,    0,  0,  0,      60,  0, 95,   0, 0.0300F, 0.0000F, 1.0000F, 1.00F, 1 },  //  初期化配列
       {     0,    8,  0,  0,      60,  0, 96,   0, 0.0300F, 0.0000F, 1.0000F, 1.00F, 1 },  //  Start時
       { 20000,    0,  0,  0,      40,  0,  0,   0, 0.0900F, 0.0000F, 0.8000F, 1.10F, 1 },  //  ライントレース
       {     0,    0,  0,  0,       0,  0, 81,   0, 0.0000F, 0.0000F, 0.0000F, 1.00F, 0 }   //  完全停止用終端配列
    };
    Clock* clock;
    int beforeDistance;
    int beforeClock;
    int courseNumber = 0;

public:
    Driver();
    void start();
    void exec();
    int courseChange();
    void btUpdate();

};
#endif  // RUNNER_DRIVER_H